package ru.leonov;

public class Task6_1 {

    //    Задание 6.1
    //    Приведите пример использования древовидной структуры.
    public static void Task() {

        System.out.println("Из жизни: Дерево ;) Система образования: Школа, классы, ученики");


        System.out.println("Программирование: Для представления иерархической структуры вложенности элементов данных,");
        System.out.println("На основе деревьев представлены некоторые алгоритмы сотрировки и поиска");
    }
}
