package ru.leonov;

public class Task5_1 {

    //        Задание 5.1
    //        Приведите пример использования рекурсии.
    public static void Task() {

        //
        //        Из жизни:
        //        - Снежинка
        //        - Матрешка
        System.out.println("Из жизни: Снежинка, Мартрешка");

        //        Программирование:
        //        - Проверка числа на простоту
        //        - Разложение на множители
        System.out.println("Программирование: Проверка числа на простоту, Разложение на множители");

    }
}
