package ru.leonov;

public class Task7_1 {
    //    Задание 7.1
    //    Приведите пример использования древовидной структуры.
    public static void Task() {

        System.out.println("Поиск решений кратчайшего пути по маршруту. Например, Yandex Метро или Yandex карты");
        System.out.println("Поиск возможных ходов в играх. Например, крестики-нолики.");
    }
}
