package ru.leonov;

import ru.leonov.heap.MyHeap;

import java.util.Arrays;

//Задание 6.7
//Приведите пример сбалансированного дерева и его применения.
public class Task6_7 {

    public static void Task() {
        System.out.println("Дерево называются сбалансированным тогда и только тогда, когда для каждого " +
                "узла высота его двух поддеревьев различается не более чем на единицу.");

        System.out.println("Пример: Красно-черные деревья");
    }
}
